import sys
import socket
from scapy.all import IP, TCP, sr1

def banner():
    print("""                 
                               █████                               
                              ███████                              
                             ████ ████                             
                            ████   ████                            
                           ████  █  ████                           
                          ███▓   █   ▓███                          
                        ░███▓  █░█ █  ▓███▒                        
                       ▒███░  █░▓█▒▒█  ░███▓                       
                      ▓███   ██ ██▓ ██   ████                      
                     ████   █▓  ███  ██   ████                     
                    ████   ▓  ▒▓███▓░  ▓   ████                    
                   ████   ░████████████▓    ████                   
                  ████                       ████                  
                 ████        ▓████████        ████                 
                ████     ██████▓   ▓██████     ████                
               ████   ██████▒         ░██████   ████               
              ████  ███▒ ██     █████▒  ██ ░███  ████              
             ████  ███  ██  ▓▓ ▒██████▓  ██  ███  ████             
            ████  ███   ██  ███████████  ██   ███  ████            
           ████    ███  ██   █████████░  ██  ███    ████           
          ████  ▒█▓  ███ ██   ███████   ██ ███  ▓█▒  ████          
         ████  ██  █  ░██████         ██████▒  █  ██  ▓███         
       ░████  █░ █▓ █    █████████████████    █ ▓█ ░█  ▓███▒       
      ▒███▒  █▒ █▓ █ █  █░    ▒█████▒    ░█  █ █ ▒█ ▒█  ░███▒      
     ▓███░  ██ ██ █ █ █▒  ░   ▒░ ░  ▒   ░  ▒█ █ █ ██ ██   ████     
    ████    ██ ██ █ █ ▓█   ░░   ▒█▒   ░   ░█▒░█ █ ██ ██    ████    
   ████                                                     ████   
  ████████████████████████████████████████████████████████████████

    Network Scanner - v0.1 - @lk-esmeraldino        
""")

def help():
    print("""
    Usage: python3 main.py <host>
          
    args:
        host: host to scan

    options:
        -h, --help: show this help
        -p, --port: port to scan
        -v, --verbose: show more info
        -sS, --stealth: use stealth scan
        
          
    example:
        python3 main.py 127.0.0.1 -p 0-65535 -sS -v
    """)

def verify_port(host, port, timeout=2) -> bool:
    with socket.socket(socket.AF_INET, socket.SOCK_STREAM) as s:
        s.settimeout(timeout)
        return s.connect_ex((host, port)) == 0

def stealth_verify_port(host, port, timeout=2) -> bool:

    #create packet
    pkt = IP(dst=host)/TCP(dport=port, flags="S")
    #send packet
    resp = sr1(pkt, timeout=timeout, verbose=False)
    #check for response
    if resp and resp.haslayer(TCP):
        if resp.getlayer(TCP).flags == 0x12:
            return True
    return False

